Hi @cwegener , thanks for opening this issue.

After looking into it, Terraform core itself already supports "defer provisioning an ephemeral resource until terraform apply if the dependent value is unknown".

-  By default, when an ephemeral resource references a **value unknown** at plan time, Terraform automatically **defers** creating that resource until the apply stage. ([documentation link](https://developer.hashicorp.com/terraform/language/block/ephemeral#order-of-provisioning))

- This prevents Terraform from failing when non-existent resources are referenced

- In your case, the error (Error: secret keycloakAdminServiceClientSecret does not exist in Key Vault (Subscription: "xxxxxxxxxxxxxxxxxxx") occurs because the name is a known value, but the secret resource doesn't exist yet.

```
ephemeral "azurerm_key_vault_secret" "keycloak_admin_service_client_secret" {
  name         = azurerm_key_vault_secret.keycloak_admin_service_client_secret.name
  key_vault_id = data.azurerm_key_vault.main.id
}
```
```
  + resource "azurerm_key_vault_secret" "keycloak_admin_service_client_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/*******/resourceGroups/example-resources/providers/Microsoft.KeyVault/vaults/******"
      + name                    = "keycloakAdminServiceClientSecret" <-- this is a known value
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply) <-- always unknown until this resource is created
      + versionless_id          = (known after apply)
    }
```

The workaround that you are proposing is a correct way to mitigate it. The `version` is a [computed only property](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/key_vault_secret.html#attributes-reference) in `azurerm_key_vault_secret`. Unlike `name` and `key_vault_id` which can be determined during planning, the `version` attribute of a resource that doesn't exist yet is genuinely unknown, forcing Terraform to defer the ephemeral resource execution until apply phase.
